Revit 2027 API
BuiltInFailures.RebarCouplerFailures.DisconnectElements Property
 Disconnect the coupler from the connected bar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DisconnectElements { get; }
Public Shared ReadOnly Property DisconnectElements As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DisconnectElements {
	FailureDefinitionId^ get ();
}
static member DisconnectElements : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace